In [59]:
import numpy as np
import pandas as pd

****************
**Creating a DataFrame**
****************

In [60]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65008, 78088, 62088, 85000]
}
df = pd.DataFrame(data)
df

    Name  Age      City  Salary
0   John   28  New York   65008
1   Anna   34     Paris   78088
2  Peter   29    Berlin   62088
3  Linda   42    London   85000

In [61]:
dataList = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]
df2 = pd.DataFrame(dataList)
columns = ["Name", "Age", "City", "Salary"]
df2 = pd.DataFrame(dataList, columns = columns)
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

****************
**Selection and Indexing of Columns**
****************

In [62]:
df2[['Name', 'City']]

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

*********************
**Creating a New Column**
*********************

In [63]:
df2['Designation'] = ['Doctor', 'Pilot', 'Developer', 'Analyst']
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000      Doctor
1   Anna   34     Paris   70000       Pilot
2  Peter   29    Berlin   62000   Developer
3  Linda   42    London   85000     Analyst

*****************
**Removing Columns**
*****************

In [64]:
df2.drop('Designation', axis=1, inplace=True)
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

*****************
**Selecting Rows**
*****************

In [66]:
df2.loc[[0,1]]

   Name  Age      City  Salary
0  John   28  New York   65000
1  Anna   34     Paris   70000

In [67]:
df.iloc[3]

Name       Linda
Age           42
City      London
Salary     85000
Name: 3, dtype: object

***********************
**Selecting Sbsets of Rows and Columns**
******************************************

In [71]:
df.loc[[2,3]][["Name", "Salary"]]

    Name  Salary
2  Peter   62088
3  Linda   85000

************
**Conditional Selection**
**************

In [72]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [76]:
df2[(df2["Age"] > 30) & (df2["City"] == "Paris")]

   Name  Age   City  Salary
1  Anna   34  Paris   70000